In [30]:
import pandas as pd
import numpy as np

In [11]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row1','Row2','Row3','Row4','Row5'], columns = ['column1','column2', 'column3','column4'])

In [12]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [13]:
df.to_csv('Test1.csv')

In [15]:
df.loc['Row1']

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [16]:
type(df.loc['Row1'])

pandas.core.series.Series

In [17]:
df['column1']

Row1     0
Row2     4
Row3     8
Row4    12
Row5    16
Name: column1, dtype: int32

In [18]:
df.iloc[:,1:]

      column2  column3  column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [19]:
df['column1'].value_counts()

column1
0     1
4     1
8     1
12    1
16    1
Name: count, dtype: int64

In [6]:
import numpy as np
import pandas as pd

In [7]:
df = pd.read_csv("higher education in usa.csv",encoding='windows-1252')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1978 entries, 0 to 1977
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        1978 non-null   int64
 1   region    1978 non-null   object
 2   name      1978 non-null   object
 3   category  1978 non-null   object
 4   url       1978 non-null   object
dtypes: int64(1), object(4)
memory usage: 77.4+ KB

In [9]:
df.head()

,id,region,name,category,url
0,222178,Texas,Abilene Christian University,Private,www.acu.edu/
1,497037,Texas,Abilene Christian University-Undergraduate Online,Private,https://www.acu.edu/academics/online/undergrad...
2,488031,California,Abraham Lincoln University,Private,https://www.alu.edu/
3,172866,Minnesota,Academy College,Private,www.academycollege.edu/
4,108232,California,Academy of Art University,Private,www.academyart.edu/

In [10]:
df.describe()

                  id
count    1978.000000
mean   223654.540445
std    109373.384957
min    100654.000000
25%    155513.250000
50%    194749.500000
75%    228338.500000
max    497268.000000

In [12]:
 df["region"].value_counts()  #count of unique values

region
New York                175
California              165
Pennsylvania            109
Texas                   107
Florida                  76
Massachusetts            74
Ohio                     74
Illinois                 74
North Carolina           63
Missouri                 56
Georgia                  55
Virginia                 54
Indiana                  53
Michigan                 48
New Jersey               48
Tennessee                44
Minnesota                41
Wisconsin                39
South Carolina           36
Iowa                     34
Maryland                 33
Alabama                  32
Washington               30
Kentucky                 29
Oregon                   29
Kansas                   29
Connecticut              28
Louisiana                27
Colorado                 26
Oklahoma                 26
Arkansas                 23
Arizona                  21
West Virginia            21
Nebraska                 21
Mississippi              18
Maine                    17
South Dakota             16
Utah                     14
New Hampshire            14
District of Columbia     12
Rhode Island             11
Vermont                  10
New Mexico               10
Montana                  10
Nevada                   10
North Dakota              9
Idaho                     8
Hawaii                    8
Alaska                    5
Delaware                  5
Wyoming                   1
Name: count, dtype: int64

In [13]:
df1 = pd.read_csv("higher education in usa.csv",encoding='windows-1252', usecols=['region','name','category'] )

In [14]:
df1.head()

       region                                               name category
0       Texas                       Abilene Christian University  Private
1       Texas  Abilene Christian University-Undergraduate Online  Private
2  California                         Abraham Lincoln University  Private
3   Minnesota                                    Academy College  Private
4  California                          Academy of Art University  Private

In [20]:
from io import StringIO

data = ('a,b,c\n'
        '1,2,3\n'
        '4,5,6\n')
print(data)

a,b,c
1,2,3
4,5,6

In [21]:
pd.read_csv(StringIO(data))

   a  b  c
0  1  2  3
1  4  5  6

In [26]:
data = {"employee_name":"Json", "email":"james@gmail.com", "job_profile":"Engineer"}
df1 = pd.DataFrame(data, index=[0]) 
print(df1)

  employee_name            email job_profile
0          Json  james@gmail.com    Engineer

In [27]:
df1.to_json()

'{"employee_name":{"0":"Json"},"email":{"0":"james@gmail.com"},"job_profile":{"0":"Engineer"}}'

In [28]:
df1.to_json(orient="records")

'[{"employee_name":"Json","email":"james@gmail.com","job_profile":"Engineer"}]'

In [29]:
df1.to_csv("job.csv")

In [32]:
print(df1)

  employee_name            email job_profile
0          Json  james@gmail.com    Engineer

In [1]:
import pandas as pd
import numpy as np

In [5]:
pip install lxml

Defaulting to user installation because normal site-packages is not writeableNote: you may need to restart the kernel to use updated packages.

Collecting lxml
  Downloading lxml-4.9.2-cp311-cp311-win_amd64.whl (3.8 MB)
                                              0.0/3.8 MB ? eta -:--:--
     ----                                     0.5/3.8 MB 9.6 MB/s eta 0:00:01
     ------------                             1.2/3.8 MB 12.3 MB/s eta 0:00:01
     ---------------------                    2.0/3.8 MB 14.0 MB/s eta 0:00:01
     ----------------------------             2.7/3.8 MB 14.4 MB/s eta 0:00:01
     --------------------------------------   3.6/3.8 MB 15.5 MB/s eta 0:00:01
     ---------------------------------------- 3.8/3.8 MB 14.1 MB/s eta 0:00:00
Installing collected packages: lxml
Successfully installed lxml-4.9.2

In [2]:
url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list"

dfs = pd.read_html(url)

In [3]:
print(dfs)

[                         Bank NameBank           CityCity StateSt  CertCert
0                  First Republic Bank      San Francisco      CA     59017  \
1                       Signature Bank           New York      NY     57053
2                  Silicon Valley Bank        Santa Clara      CA     24735
3                    Almena State Bank             Almena      KS     15426
4           First City Bank of Florida  Fort Walton Beach      FL     16748
..                                 ...                ...     ...       ...
561                 Superior Bank, FSB           Hinsdale      IL     32646
562                Malta National Bank              Malta      OH      6629
563    First Alliance Bank & Trust Co.         Manchester      NH     34264
564  National State Bank of Metropolis         Metropolis      IL      3815
565                   Bank of Honolulu           Honolulu      HI     21029

                 Acquiring InstitutionAI Closing DateClosing  FundFund
0              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
1                    Flagstar Bank, N.A.      March 12, 2023     10540
2    Firstâ€“Citizens Bank & Trust Company      March 10, 2023     10539
3                            Equity Bank    October 23, 2020     10538
4              United Fidelity Bank, fsb    October 16, 2020     10537
..                                   ...                 ...       ...
561                Superior Federal, FSB       July 27, 2001      6004
562                    North Valley Bank         May 3, 2001      4648
563  Southern New Hampshire Bank & Trust    February 2, 2001      4647
564              Banterra Bank of Marion   December 14, 2000      4646
565                   Bank of the Orient    October 13, 2000      4645

[566 rows x 7 columns]]